Catalogs/ФСК_Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФСК_Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФСК_ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФСК_Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HTTPServices/QMS_ObmenNomenklatura/Ext/Module.bsl
Функция GetNomenklaturaGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса(Запрос);
	
	ЗаписьJSON = новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	
	Запрос = СформироватьЗапросНоменклатуры(ПараметрыЗапроса);
	
	НоменклатураТЗ = Запрос.Выполнить().Выгрузить();
	ВидНоменклатурыОтбор = НоменклатураТЗ.ВыгрузитьКолонку("ВидНоменклатуры");
	ОрганизацииОтбор = НоменклатураТЗ.ВыгрузитьКолонку("Организация");
	
	ВыборкаВидыНоменклатуры = ПолучитьВыборкуВидыНоменклатуры(ВидНоменклатурыОтбор);
	
	ВыборкаОрганизации = ПолучитьВыборкуОрганизации(ОрганизацииОтбор);
	
	НоменклатураМассив = Новый Массив;
	ВидыНоменклатурыМассив = Новый Массив;
	ОрганизацииМассив = Новый Массив;
	
	Для каждого НоменклатураСтрока Из НоменклатураТЗ Цикл
		НоменклатураСтруктура = СформироватьНомеклатуруСтруктура(НоменклатураСтрока);
		НоменклатураМассив.Добавить(НоменклатураСтруктура);
	КонецЦикла;
	
	Пока ВыборкаВидыНоменклатуры.Следующий() Цикл
		ВидНоменклатурыСтруктура = СформироватьВидНомеклатурыСтруктура(ВыборкаВидыНоменклатуры);
		ВидыНоменклатурыМассив.Добавить(ВидНоменклатурыСтруктура);
	КонецЦикла;
	
	Пока ВыборкаОрганизации.Следующий() Цикл
		ОрганизацияСтруктура = СформироватьОрганизациюСтруктура(ВыборкаОрганизации);
		ОрганизацииМассив.Добавить(ОрганизацияСтруктура);
	КонецЦикла;
	
	ОтветСтруктура = Новый Структура();
	ОтветСтруктура.Вставить("Nomenklaturа", НоменклатураМассив);
	ОтветСтруктура.Вставить("VidNomenklaturi", ВидыНоменклатурыМассив);
	ОтветСтруктура.Вставить("Organizatsiya", ОрганизацииМассив);
	
	ЗаписатьJSON(ЗаписьJSON, ОтветСтруктура);
	СериализованнаяСтрока = ЗаписьJSON.Закрыть();
	
	ТекстСообщения = СериализованнаяСтрока;
	
	ЗаписьJSON = Неопределено;
	Ответ.УстановитьТелоИзСтроки(ТекстСообщения);
	
	Возврат Ответ;
КонецФункции

Функция ПолучитьПараметрыЗапроса(Запрос)

	пЛогин = Запрос.ПараметрыЗапроса.Получить("login");
	пПароль = Запрос.ПараметрыЗапроса.Получить("password");
	пДата = Запрос.ПараметрыЗапроса.Получить("date");
	пВидНоменклатуры = Запрос.ПараметрыЗапроса.Получить("type");

	Если пДата <> Неопределено И пДата <> Дата(1,1,1) Тогда
		пДата = Дата(пДата);
	КонецЕсли;
	
	Если пВидНоменклатуры <> Неопределено 
		И пВидНоменклатуры <> Справочники.ФСК_ВидыНоменклатуры.ПустаяСсылка() Тогда
		пВидНоменклатуры = Справочники.ФСК_ВидыНоменклатуры.НайтиПоНаименованию(пВидНоменклатуры);
	КонецЕсли;
	
	ПараметрыЗапросаСтруктура = Новый Структура();
	ПараметрыЗапросаСтруктура.Вставить("пЛогин", пЛогин);
	ПараметрыЗапросаСтруктура.Вставить("пПароль", пПароль);
	ПараметрыЗапросаСтруктура.Вставить("пДата", пДата);
	ПараметрыЗапросаСтруктура.Вставить("пВидНоменклатуры", пВидНоменклатуры);
	
	Возврат ПараметрыЗапросаСтруктура;
	
КонецФункции

Функция СформироватьЗапросНоменклатуры(ПараметрыЗапроса)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ФСК_Номенклатура.Ссылка) КАК НоменклатураГУИД,
		|	ФСК_Номенклатура.Наименование КАК Наименование,
		|	ФСК_Номенклатура.Артикул КАК Артикул,
		|	ФСК_Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ФСК_Номенклатура.ВидНоменклатуры) КАК ВидНоменклатурыГУИД,
		|	ФСК_Номенклатура.ВидНоменклатуры.Наименование КАК ВидНоменклатурыНаименование,
		|	ФСК_Номенклатура.Организация КАК Организация,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ФСК_Номенклатура.Организация) КАК ОрганизацияГУИД,
		|	ФСК_Номенклатура.Организация.Наименование КАК НаименованиеОрганизации,
		|	ФСК_Номенклатура.ДатаСоздания КАК ДатаСоздания
		|ИЗ
		|	Справочник.ФСК_Номенклатура КАК ФСК_Номенклатура
		|ГДЕ
		|	ИСТИНА";
	
	Если ПараметрыЗапроса.пДата <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "И ФСК_Номенклатура.ДатаСоздания >= &пДата";
		Запрос.УстановитьПараметр("пДата", ПараметрыЗапроса.пДата);
	КонецЕсли;
	
	Если ПараметрыЗапроса.пВидНоменклатуры <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "И ФСК_Номенклатура.ВидНоменклатуры = &пВидНоменклатуры";
		Запрос.УстановитьПараметр("пВидНоменклатуры", ПараметрыЗапроса.пВидНоменклатуры);
	КонецЕсли;
	
	Возврат Запрос;

КонецФункции

Функция ПолучитьВыборкуВидыНоменклатуры(ВидНоменклатурыОтбор)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ФСК_ВидыНоменклатуры.Ссылка) КАК ВидНоменклатурыГУИД,
		|	ФСК_ВидыНоменклатуры.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ФСК_ВидыНоменклатуры КАК ФСК_ВидыНоменклатуры
		|ГДЕ
		|	ФСК_ВидыНоменклатуры.Ссылка В(&ВидНоменклатурыОтбор)";
	
	Запрос.УстановитьПараметр("ВидНоменклатурыОтбор", ВидНоменклатурыОтбор);
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция ПолучитьВыборкуОрганизации(ОрганизацииОтбор)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ФСК_Организации.Ссылка) КАК ОрганизацияГУИД,
		|	ФСК_Организации.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ФСК_Организации КАК ФСК_Организации
		|ГДЕ
		|	ФСК_Организации.Ссылка В(&ОрганизацииОтбор)";
	
	Запрос.УстановитьПараметр("ОрганизацииОтбор", ОрганизацииОтбор);
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Функция СформироватьНомеклатуруСтруктура(НоменклатураСтрока)

	НоменклатураСтруктура = Новый Структура();
	НоменклатураСтруктура.Вставить("ID", Строка(НоменклатураСтрока.НоменклатураГУИД));
	НоменклатураСтруктура.Вставить("Naimenovanie", Строка(НоменклатураСтрока.Наименование));
	НоменклатураСтруктура.Вставить("Artikul", Строка(НоменклатураСтрока.Артикул));
	НоменклатураСтруктура.Вставить("IDVidaNomenklaturi", Строка(НоменклатураСтрока.ВидНоменклатурыГУИД));
	НоменклатураСтруктура.Вставить("NaimenovanieVida", Строка(НоменклатураСтрока.ВидНоменклатурыНаименование));
	НоменклатураСтруктура.Вставить("IDOrganizatsii", Строка(НоменклатураСтрока.ОрганизацияГУИД));
	НоменклатураСтруктура.Вставить("NaimenovanieOrganizatsii", Строка(НоменклатураСтрока.НаименованиеОрганизации));
	
	Возврат НоменклатураСтруктура;
	
КонецФункции

Функция СформироватьВидНомеклатурыСтруктура(ВыборкаВидыНоменклатуры)

	ВидНоменклатурыСтруктура = Новый Структура();
	ВидНоменклатурыСтруктура.Вставить("ID",Строка(ВыборкаВидыНоменклатуры.ВидНоменклатурыГУИД));
	ВидНоменклатурыСтруктура.Вставить("Naimenovanie",Строка(ВыборкаВидыНоменклатуры.Наименование));
	
	Возврат ВидНоменклатурыСтруктура
	
КонецФункции

Функция СформироватьОрганизациюСтруктура(ВыборкаОрганизации)

	ОрганизацияСтруктура = Новый Структура();
	ОрганизацияСтруктура.Вставить("ID",Строка(ВыборкаОрганизации.ОрганизацияГУИД));
	ОрганизацияСтруктура.Вставить("Naimenovanie",Строка(ВыборкаОрганизации.Наименование));
	
	Возврат ОрганизацияСтруктура;

КонецФункции
